x1=[30 50];
y1=[15.885,37.855];
x2=[50 60 80 90 100 120 130 150 180];
y2=[27.38 30.36666667 40.05 45.25 71.63 90.91 114.635 111.465 216.91];
x3=[10 20 25 27 28 30 40];
y3=[9.0875 19.16 14.59 19.39 25.0225 32.62 36.55];
x4=[10 15 50 80];
y4=[1.385 5.53 11.585 31.435];

plot(x1,y1,'r','LineWidth',2);
hold on
grid on
plot(x2,y2,'g','LineWidth',2);
hold on
plot(x3,y3,'b','LineWidth',2);
hold on
plot(x4,y4,'k','LineWidth',2);
hold on

xlabel('周期个数/次');
ylabel('偏转角/度');
title('周期个数-偏转角度曲线');
legend('占空比40频率100','占空比60频率200','占空比60频率300',....
'占空比80频率200');




